In [1]:
import pandas as pd
import numpy as np
import os

In [4]:
file = os.path.join("Resources", "ted_talks.csv")
df = pd.read_csv(file)
df.head(2)

,comments,description,duration,event,languages,main_speaker,name,title,views
0,4553,Sir Ken Robinson makes an entertaining and pro...,1164,TED2006,60,Ken Robinson,Ken Robinson: Do schools kill creativity?,Do schools kill creativity?,47227110
1,265,With the same humor and humanity he exuded in ...,977,TED2006,43,Al Gore,Al Gore: Averting the climate crisis,Averting the climate crisis,3200520

In [6]:
df["views"].min()

50443

In [7]:
df["views"].max()

47227110

In [25]:
bins = [0, 1000000, 2000000, 3000000, 4000000, 5000000, 6000000, 7000000, 8000000, 9000000, 50000000]
group_labels = ["0 to 199k", "200k to 399k", "400k to 599k", "600k to 799k", "800k to 999k", "1mil to 2mil",
                "2mil to 3mil", "3mil to 4mil", "4mil to 5mil", "5mil to 50mil"]

In [26]:
df["View Groups"]= pd.cut(df["views"], bins, labels=group_labels)
df.head(2)

,comments,description,duration,event,languages,main_speaker,name,title,views,View_Groups,View Groups
0,4553,Sir Ken Robinson makes an entertaining and pro...,1164,TED2006,60,Ken Robinson,Ken Robinson: Do schools kill creativity?,Do schools kill creativity?,47227110,J,5mil to 50mil
1,265,With the same humor and humanity he exuded in ...,977,TED2006,43,Al Gore,Al Gore: Averting the climate crisis,Averting the climate crisis,3200520,D,600k to 799k

In [31]:
df1 = df.groupby("View Groups")
df1["View Groups"].count()

View Groups
0 to 199k        1047
200k to 399k     1004
400k to 599k      239
600k to 799k       93
800k to 999k       68
1mil to 2mil       16
2mil to 3mil       16
3mil to 4mil       14
4mil to 5mil       12
5mil to 50mil      41
Name: View Groups, dtype: int64

In [34]:
df.groupby("View Groups").mean()
df1[["comments", "duration", "languages"]].mean()

                 comments     duration  languages
View Groups
0 to 199k      110.474690   831.029608  23.142311
200k to 399k   168.136454   809.899402  27.899402
400k to 599k   299.481172   832.430962  32.807531
600k to 799k   360.870968   809.505376  34.258065
800k to 999k   507.088235   920.514706  35.720588
1mil to 2mil   374.375000   882.937500  37.500000
2mil to 3mil   346.625000   746.437500  40.375000
3mil to 4mil   591.714286  1002.285714  39.071429
4mil to 5mil   549.250000   719.500000  37.166667
5mil to 50mil  926.292683   946.536585  42.585366